app/controllers/api/posts_controller.rb

SELECT "posts".* FROM "posts"
---
      def index
        render json: Post.all